src/Documents/Scan_ЗаявкаНаДействие/Scan_ЗаявкаНаДействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаНаДействие</name>
  <registerRecords>InformationRegister.Scan_КорректировкаИнформацииПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.Scan_РеестрОказанныхУслугДилеру</registerRecords>
  <registerRecords>AccumulationRegister.Scan_ЗаявкиНаДействия</registerRecords>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиПлановая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоДоставки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемВВыходныеИПраздничные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПродажи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыкупа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачиВПроизводство</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторнирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСПоставщиком</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяПоручения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранитель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПолучения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПакетУслуг</name>
    <type>
      <types>CatalogRef.Scan_ПакетыУслугДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыездСотрудникаОЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Scan_КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтактнойИнформации</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПродуктыПоЗаявке</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказанныеУслуги</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_КорректировкаИнформацииПоЗаявкам/Scan_КорректировкаИнформацииПоЗаявкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КорректировкаИнформацииПоЗаявкам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗаявкаПеревозчику</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
    </type>
  </resources>
  <resources>
    <name>СтатусИзделия</name>
    <type>
      <types>EnumRef.Scan_СтатусыИзделий</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставкиПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>МестоДоставки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </resources>
  <resources>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </resources>
  <resources>
    <name>ПриемВВыходныеДни</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонечныйКлиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаДействие</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>GuidСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ВидыДокументов/Scan_ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыДокументов</name>
  <comment>(scania)</comment>
  <enumValues>
    <name>ЗаявкаНаДействие</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаПеревозчику</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_ДополнительныеУсловияДоставки/Scan_ДополнительныеУсловияДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ДополнительныеУсловияДоставки</name>
  <attributes>
    <name>ИспользоватьПоУмолчаниюВПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользованиеВДокументах</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>EnumRef.Scan_ВидыДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_Контрагенты/Scan_Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ГруппаСкания</name>
      <description>Группа Скания</description>
    </items>
    <items>
      <name>Дилеры</name>
      <description>Дилеры</description>
    </items>
    <items>
      <name>Клиенты</name>
      <description>Клиенты</description>
    </items>
    <items>
      <name>Перевозчики</name>
      <description>Перевозчики</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаJenty</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОсн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеОсн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенноеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <comment>Контрагент больше не используется в программе, но сведения о нем сохранены. Недействительные контрагенты скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Резидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Scan_ЗаявкаНаДействие/Forms/ФормаНастроекПечати/Module.bsl
//rarus sergei 29.09.2016 mantis 7162 ++
&НаСервере
Процедура ЗаполнитьДопУсловияДоставки()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ДополнительныеУсловияДоставки.Ссылка
	               |ИЗ
	               |	Справочник.Scan_ДополнительныеУсловияДоставки КАК Scan_ДополнительныеУсловияДоставки
	               |ГДЕ
	               |	Scan_ДополнительныеУсловияДоставки.ИспользоватьПоУмолчаниюВПФ = ИСТИНА
	               |	И Scan_ДополнительныеУсловияДоставки.ИспользованиеВДокументах.Документ = ЗНАЧЕНИЕ(Перечисление.Scan_ВидыДокументов.ЗаявкаНаДействие)";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Условие Из Результат Цикл
		НоваяСтрока = ДопУсловия.Добавить();
		НоваяСтрока.ДопУсловие = Условие.Ссылка;	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеДляПечати.ЗагрузитьЗначения(Параметры.ДанныеДляПечати);
	ЭтаФорма.Заголовок ="Настройка печати документа Заявка на Действие с хоз операцией "+ДанныеДляПечати[0].Значение.ХозОперация;
	ИмяМакета = Параметры.ПечатнаяФорма;
	Если ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаВПроизводство ИЛИ
		ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПередачаВПроизводство Тогда
		Элементы.ВыводитьСпецификацииИзделий.Видимость = Ложь;	
	КонецЕсли; 
	Если ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.Доставка ИЛИ 
		//rarus tenkam 08.02.2017 mantis 8331 +++
		ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПостановкаНаХранение ИЛИ
		ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ДоставкаИПередачаВПроизводство ИЛИ
		//rarus tenkam 08.02.2017 mantis 8331 ---
		ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаИПередачаТК ИЛИ
		ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПокупкаУПоставщикаПродажаТретьемуЛицуИПередачаТК	ИЛИ
		ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПродажаТретьемуЛицуСоСкладаСканияРусьИПередачаТК ИЛИ 		//rarus tenkam 26.09.2017 mantis 10742 +
		ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияИПередачаТК ИЛИ
		ДанныеДляПечати[0].Значение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.СнятиеСХраненияПродажаТретьемуЛицуИПередачаТК Тогда 
		Для каждого строка Из ДанныеДляПечати Цикл
			
			ВыборкаКорректировок = РегистрыСведений.Scan_КорректировкаИнформацииПоЗаявкам.ВыбратьПоРегистратору(строка.Значение);
			Пока ВыборкаКорректировок.Следующий() Цикл
				Если ВыборкаКорректировок.Перевозчик <> Справочники.Scan_Контрагенты.ПустаяСсылка() Тогда
					Если Перевозчики.Количество() = 0 Тогда 
						НоваяСтрока = Перевозчики.Добавить();
						НоваяСтрока.Перевозчик = ВыборкаКорректировок.Перевозчик;
						НоваяСтрока.ЗаявкаНаДействие = строка.Значение;
						НоваяСтрока.ЗаявкаПеревозчику = ВыборкаКорректировок.ЗаявкаПеревозчику;
						НоваяСтрока.ДоговорСПеревозчиком = ВыборкаКорректировок.ЗаявкаПеревозчику.ДоговорСПеревозчиком;
					Иначе
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("ЗаявкаПеревозчику", ВыборкаКорректировок.ЗаявкаПеревозчику);
						НайденныеСтроки = Перевозчики.НайтиСтроки(ПараметрыОтбора);
						Если НайденныеСтроки.Количество() = 0 Тогда
							НоваяСтрока = Перевозчики.Добавить();
							НоваяСтрока.Перевозчик = ВыборкаКорректировок.Перевозчик;
							НоваяСтрока.ЗаявкаНаДействие = строка.Значение;
							НоваяСтрока.ЗаявкаПеревозчику = ВыборкаКорректировок.ЗаявкаПеревозчику;
							НоваяСтрока.ДоговорСПеревозчиком = ВыборкаКорректировок.ЗаявкаПеревозчику.ДоговорСПеревозчиком;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
		КонецЦикла; 
		
		Если ДанныеДляПечати.Количество()>1 Тогда
			Элементы.ПеревозчикиЗаявкаНаДействие.Видимость = Истина;
		Иначе
			Элементы.ПеревозчикиЗаявкаНаДействие.Видимость = Ложь;
		КонецЕсли;
		Если Перевозчики.Количество() = 0 Тогда
			Элементы.Перевозчики.Видимость = Ложь;
		Иначе
			Элементы.Перевозчики.Видимость = Истина;	
		КонецЕсли; 
	Иначе
		Элементы.Перевозчики.Видимость = Ложь;	
	КонецЕсли;
	
	ЗаполнитьДопУсловияДоставки();
	НастройкаДопУсловий();
КонецПроцедуры


&НаСервере
Процедура НастройкаДопУсловий()
	Если ПоказыватьДопУсловия = ИСТИНА Тогда
		Элементы.ДопУсловия.Видимость = Истина;
	Иначе
		Элементы.ДопУсловия.Видимость = ЛОЖЬ;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПоказыватьДопУсловияПриИзменении(Элемент)
	НастройкаДопУсловий();
КонецПроцедуры


&НаКлиенте
Процедура КомандаОк(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(    "Документ.Scan_ЗаявкаНаДействие",        //Менеджер печати
                            ИмяМакета,            //Идентификатор
                            ПолучитьОбъектыДляПечати(),        //Объекты печати
                            ЭтотОбъект,                //Владелец формы - форма из которой вызывается печать
                            ПолучитьПараметрыПечати());        //Параметры печати - произвольные параметры для передачи в менеджер печати
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектыДляПечати()
    Массив = ДанныеДляПечати.ВыгрузитьЗначения();
    Возврат Массив;
КонецФункции

&НаСервере
Функция ПолучитьПараметрыПечати()
    
    ПараметрыПечати = Новый Структура;
	Если Элементы.Перевозчики.Видимость = Истина Тогда
		ПараметрыПечати.Вставить("ТаблицаПеревозчиков",Перевозчики);
	КонецЕсли;	
	ПараметрыПечати.Вставить("ЗаголовокФормы", "Печатная форма");                    //Один из параметров, для формы "Печать документа".
                                                    								 //Указывает заголовок формы вывода печатной формы.
																			 
	ПараметрыПечати.Вставить("ВыводитьСпецификацииИзделий",  ВыводитьСпецификацииИзделий);
	ПараметрыПечати.Вставить("ПоказыватьДопУсловия",         ПоказыватьДопУсловия);
	ПараметрыПечати.Вставить("ДопУсловия",                   ДопУсловия);
	// rarus agar 14.12.2022 19668 ++
	ПараметрыПечати.Вставить("ВыводитьЛоготип",              ВыводитьЛоготип);
	// rarus agar 14.12.2022 19668 --
    Возврат ПараметрыПечати;
    
КонецФункции

//rarus sergei 29.09.2016 mantis 7162 --
